import numpy as np
import pandas as pd
df=pd.read_excel("D:/stud_marks.xlsx")
print("Welcome to data reading from excel")

In [2]:
import numpy as np
import pandas as pd
df=pd.read_excel("D:/stud_marks.xlsx",sheet_name='c')
print("Welcome to data reading from excel")

Welcome to data reading from excel

In [3]:
df.head()

   S.no    Roll No               Name 12th Marks  12th %
0     1  23BSDS101           AADISH S        333   55.50
1     2  23BSDS102  ADITHYA KRISHNA.M        462   77.00
2     3  23BSDS103   AJAY RATHNAVEL.K        510   85.00
3     4  23BSDS104           AKALYA.M        481   80.17
4     5  23BSDS105     ANNE DEBORA. P        497  497.00

In [4]:
df.tail()

    S.no    Roll No              Name 12th Marks  12th %
60    61  23BSDS161        VISHANTH M        402    67.0
61    62  23BSDS162          VISHNU.C        487    81.0
62    63  23BSDS163  VISHNU PRADEEP.S        427    71.2
63    64  23BSDS164        VIVITHA. M        439    73.0
64    65  23BSDS165    YADHUKRISHNA K        705    58.0

In [5]:
df.describe()

           S.no      12th %
count  65.00000   65.000000
mean   33.00000   78.185692
std    18.90767   53.763199
min     1.00000   51.000000
25%    17.00000   64.000000
50%    33.00000   72.000000
75%    49.00000   78.800000
max    65.00000  497.000000

In [6]:
df.columns

Index(['S.no', 'Roll No', 'Name', '12th Marks', '12th %'], dtype='object')

In [26]:
df.info

<bound method DataFrame.info of       Roll No               Name HSC Marks  12th %
0   23BSDS101           AADISH S       333   55.50
1   23BSDS102  ADITHYA KRISHNA.M       462   77.00
2   23BSDS103   AJAY RATHNAVEL.K       510   85.00
3   23BSDS104           AKALYA.M       481   80.17
4   23BSDS105     ANNE DEBORA. P       497  497.00
..        ...                ...       ...     ...
60  23BSDS161         VISHANTH M       402   67.00
61  23BSDS162           VISHNU.C       487   81.00
62  23BSDS163   VISHNU PRADEEP.S       427   71.20
63  23BSDS164         VIVITHA. M       439   73.00
64  23BSDS165     YADHUKRISHNA K       705   58.00

[65 rows x 4 columns]>

In [8]:
df.index

RangeIndex(start=0, stop=65, step=1)

In [9]:
df.columns.tolist()

['S.no', 'Roll No', 'Name', '12th Marks', '12th %']

In [10]:
df.index.tolist()

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64]

In [11]:
print(type(df.columns.tolist()))
print(type(df.index.tolist()))

<class 'list'>
<class 'list'>

In [12]:
df.shape

(65, 5)

In [13]:
# in pandas axis=0 represents rows (default) and axis=1 represents columns.
df.drop(['S.no'], axis=1, inplace=True)
df.head(2)

     Roll No               Name 12th Marks  12th %
0  23BSDS101           AADISH S        333    55.5
1  23BSDS102  ADITHYA KRISHNA.M        462    77.0

In [14]:
df.rename(columns={'12th Marks':'HSC Marks'}, inplace=True)
df.columns

Index(['Roll No', 'Name', 'HSC Marks', '12th %'], dtype='object')

In [15]:
total = df.sum(axis=1)
print(total)

0      55.50
1      77.00
2      85.00
3      80.17
4     497.00
       ...
60     67.00
61     81.00
62     71.20
63     73.00
64     58.00
Length: 65, dtype: float64

C:\Users\DELL\AppData\Local\Temp\ipykernel_4956\1994963151.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  total = df.sum(axis=1)

In [16]:
df.isnull().sum()

Roll No      0
Name         0
HSC Marks    0
12th %       0
dtype: int64

In [17]:
df.Name

0              AADISH S
1     ADITHYA KRISHNA.M
2      AJAY RATHNAVEL.K
3              AKALYA.M
4        ANNE DEBORA. P
            ...
60           VISHANTH M
61             VISHNU.C
62     VISHNU PRADEEP.S
63           VIVITHA. M
64       YADHUKRISHNA K
Name: Name, Length: 65, dtype: object

In [18]:
df

      Roll No               Name HSC Marks  12th %
0   23BSDS101           AADISH S       333   55.50
1   23BSDS102  ADITHYA KRISHNA.M       462   77.00
2   23BSDS103   AJAY RATHNAVEL.K       510   85.00
3   23BSDS104           AKALYA.M       481   80.17
4   23BSDS105     ANNE DEBORA. P       497  497.00
..        ...                ...       ...     ...
60  23BSDS161         VISHANTH M       402   67.00
61  23BSDS162           VISHNU.C       487   81.00
62  23BSDS163   VISHNU PRADEEP.S       427   71.20
63  23BSDS164         VIVITHA. M       439   73.00
64  23BSDS165     YADHUKRISHNA K       705   58.00

[65 rows x 4 columns]

In [19]:
df.head

<bound method NDFrame.head of       Roll No               Name HSC Marks  12th %
0   23BSDS101           AADISH S       333   55.50
1   23BSDS102  ADITHYA KRISHNA.M       462   77.00
2   23BSDS103   AJAY RATHNAVEL.K       510   85.00
3   23BSDS104           AKALYA.M       481   80.17
4   23BSDS105     ANNE DEBORA. P       497  497.00
..        ...                ...       ...     ...
60  23BSDS161         VISHANTH M       402   67.00
61  23BSDS162           VISHNU.C       487   81.00
62  23BSDS163   VISHNU PRADEEP.S       427   71.20
63  23BSDS164         VIVITHA. M       439   73.00
64  23BSDS165     YADHUKRISHNA K       705   58.00

[65 rows x 4 columns]>

In [20]:
df.head(5)

     Roll No               Name HSC Marks  12th %
0  23BSDS101           AADISH S       333   55.50
1  23BSDS102  ADITHYA KRISHNA.M       462   77.00
2  23BSDS103   AJAY RATHNAVEL.K       510   85.00
3  23BSDS104           AKALYA.M       481   80.17
4  23BSDS105     ANNE DEBORA. P       497  497.00

In [21]:
df.head(5)

     Roll No               Name HSC Marks  12th %
0  23BSDS101           AADISH S       333   55.50
1  23BSDS102  ADITHYA KRISHNA.M       462   77.00
2  23BSDS103   AJAY RATHNAVEL.K       510   85.00
3  23BSDS104           AKALYA.M       481   80.17
4  23BSDS105     ANNE DEBORA. P       497  497.00

In [22]:
df.iloc[3]

Roll No      23BSDS104
Name          AKALYA.M
HSC Marks          481
12th %           80.17
Name: 3, dtype: object

In [23]:
df.loc[1]

Roll No              23BSDS102
Name         ADITHYA KRISHNA.M
HSC Marks                  462
12th %                    77.0
Name: 1, dtype: object

In [24]:
df[df.index == '9']

Empty DataFrame
Columns: [Roll No, Name, HSC Marks, 12th %]
Index: []